#include "pch.h"

namespace Battlefield {

	/********************************************************/
	/*					 Конструкторы						*/
	/********************************************************/

	// Конструктор, создающий ящик с 40 патронами и тратящий 2 TP на перезарядку
	AmmoBox::AmmoBox(int up, double wof, int maxqty) : Item(up) {
		if (wof <= 0)
			throw std::invalid_argument("Вес патрона должен быть положительным. Попробуйте еще раз.");
		if (maxqty < 0)
			throw std::invalid_argument("Ящик не может иметь отрицательный боезапас. Попробуйте еще раз.");
		weightOfOne = wof;
		maxQty = maxqty;
		qty = maxqty;
		set_weight();
	}



	/********************************************************/
	/*						Геттеры							*/
	/********************************************************/




	/********************************************************/
	/*						Сеттеры							*/
	/********************************************************/

	// Пересчет веса для оруженого ящика
	const AmmoBox& AmmoBox::set_weight() {
		weight = weightOfOne * qty;
		return *this;
	}

	/********************************************************/
	/*					Остальные методы					*/
	/********************************************************/




}
