#ifndef ITEM_H
#define ITEM_H


namespace Battlefield {

	class Item {
	private:
		// Вес предмета
		int weight;
		// Кол-во очков, которые нужно потратить, чтобы заюзать предмет (выстрелить, захилиться, перезарядиться и тд)
		int usedPoint;
	public:

		/********************************************************/
		/*					 Конструкторы						*/
		/********************************************************/

		// Копирующие/перемещающие конструкторы по умолчанию


		Item(int w = 1, int uP = 1) noexcept : weight(w), usedPoint(uP) {};

		/********************************************************/
		/*						Геттеры							*/
		/********************************************************/

		int get_weight() { return weight; };
		int get_uP() { return usedPoint; };


		/********************************************************/
		/*						Сеттеры							*/
		/********************************************************/

		Item& set_weight(int);
		Item& set_usedPoint(int);

		/********************************************************/
		/*					Остальные методы					*/
		/********************************************************/



	// Создание копии предмета
		Item* clone() { return this; };

	};

}

#endif // !_ITEM_H_



