#include "pch.h"

namespace XCom {

	/********************************************************/
	/*					 Конструкторы						*/
	/********************************************************/


	// Единственный конструктор
	Item::Item(int uP) : weight(0) {
		if (uP < 1)
			throw std::invalid_argument("Количество затрачиваемых TP должно быть положительным. Попробуйте еще раз.");
		usedPoint = uP;
	}



	/********************************************************/
	/*						Сеттеры							*/
	/********************************************************/

	Item& Item::set_usedPoint(int uP) {
		if (uP < 1)
			throw std::invalid_argument("Кол-во расходных очков времени должно быть положительным. Попробуйте еще раз.");
		usedPoint = uP;
		return *this;
	}


}
